src/cf/Documents/ДанныеДокументаМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДанныеДокументаМЭДО</Name>
			<Comment>Дополнительная детализация документа для МЭДО</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументовМЭДО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйФайл</Name>
					<Comment>Главный документ из сообщения, остальные - приложения к нему</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаСоставленияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтветственныйМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяОтправка</Name>
					<Comment>Для повторной отправки одного этого же документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Comment>Для отбора в списке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияМЭДО</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторСообщения</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияМЭДО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/УровниСобытийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УровниСобытийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ДанныеДокументаМЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить все или часть данных для МЭДО по документу. Ищется только актуальный документ, предыдущие отправки
// хранятся просто для истории.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  Поля - Строка - Поля документа, через запятую, которые нужно получить, можно указать * - т.е. все, включая Ссылка.
//  				Можно получать поля через точку, т.е. передавать Поля, как часть запроса для ВЫБРАТЬ.
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйОтвет.
// 
// Возвращаемое значение:
//  Структура - Поля зависят переданного параметра Поля, полный состав полей см. ДокументОбъект.ДанныеДокументаМЭДО
Функция ДанныеДокументаМЭДО(Документ, Поля, ДанныеОтвета) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		МЭДО.ЗаписьВЖурналСобытий(
			Перечисления.УровниСобытийМЭДО.Ошибка, 
			НСтр("ru = 'Пустой документ'"),
			НСтр("ru = 'Не указан документ'"),
			НСтр("ru = 'Для получения данных МЭДО по документу не указан сам документ'"),
			ДанныеОтвета);
		Возврат Новый Структура();
	КонецЕсли;
	
	Результат = РезультатЗапросаДанныеДокументаМЭДО(Документ, Поля, Истина);
	Возврат МЭДОСтруктурыДанных.РезультатЗапросаВСтруктуру(Результат);
	
КонецФункции

// Получить все или часть данных для МЭДО по документу, либо только актуальные, либо всю историю.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  Поля - Строка - Поля документа, через запятую, которые нужно получить, можно указать * - т.е. все, включая Ссылка.
//  				Можно получать поля через точку, т.е. передавать Поля, как часть запроса для ВЫБРАТЬ.
//  ТолькоАктуальные - Булево - Учитывать только актуальные данные или всю историю, включая предыдущие отправки.
// 
// Возвращаемое значение:
//  РезультатЗапроса -  Поля результата зависят переданного параметра Поля
Функция РезультатЗапросаДанныеДокументаМЭДО(Документ, Поля, ТолькоАктуальные) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	Документ.ДанныеДокументаМЭДО КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Документ = &Документ
		|УПОРЯДОЧИТЬ ПО Дата УБЫВ");
	Если Не ТолькоАктуальные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1", "ВЫБРАТЬ");
	КонецЕсли;
	
	Если Поля <> "*" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", Поля);
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);
	Возврат Запрос.Выполнить();
	
КонецФункции

// Обертка - Получить объект данных документа, если он есть. Ищется только актуальный документ, предыдущие отправки
// хранятся просто для истории. Если актуального нет, то создается новый. 
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйОтвет.
// 
// Возвращаемое значение:
//  ДокументОбъект.ДанныеДокументаМЭДО
Функция ОбъектДанныхДокумента(Документ, ДанныеОтвета) Экспорт
	
	ДанныеДокументаВИБ = ДанныеДокументаМЭДО(Документ, "Ссылка", ДанныеОтвета);
	Если Не ДанныеОтвета.Успех Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокументаВИБ.Ссылка) Тогда
		Возврат ДанныеДокументаВИБ.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ДанныеОбъект = СоздатьДокумент();
	ДанныеОбъект.Документ = Документ;
	Если Не ЗначениеЗаполнено(ДанныеОбъект.Дата) Тогда
		ДанныеОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ДанныеОбъект;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Снять признак "Готов к отправке" с исходящего документа - в случае неуспешной отправки.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО
//  ДанныеОтвета - см. МЭДОСтруктурыДанных.НовыйЛегкийОтвет.
Процедура СнятьПризнакГотовКОтправке(Документ, ДанныеОтвета) Экспорт
	
	ДанныеМЭДО = ДанныеДокументаМЭДО(Документ, "Ссылка", ДанныеОтвета);
	Если Не ЗначениеЗаполнено(ДанныеМЭДО.Ссылка) Тогда
		Возврат; // на данном этапе отправки ДанныеДокументаМЭДО даже не существует, ничего не надо делать.
	КонецЕсли;
	
	ДанныеОбъект = ДанныеМЭДО.Ссылка.ПолучитьОбъект();
	Если Не ДанныеОбъект.ГотовКОтправке Тогда
		Возврат; // перестраховка, флаг должен стоять.
	КонецЕсли;
	ДанныеОбъект.ГотовКОтправке = Ложь;
	ДанныеОбъект.Отправлен = Ложь;
	Попытка
		ДанныеОбъект.Записать();
	Исключение
		СтекОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); //@skip-check bsl-legacy-check-static-feature-access
		МЭДО.ЗаписьВЖурналСобытий(
			Перечисления.УровниСобытийМЭДО.Ошибка,
			ДанныеОбъект.Документ,
			Текст_ОшибкаЗаписиДанныхДокумента(),
			СтрШаблон("%1: %2", Текст_ОшибкаЗаписиДанныхДокумента(), СтекОшибки),
			ДанныеОтвета);
	КонецПопытки;
	МЭДО.ЗаписьВЖурналСобытий(
		Перечисления.УровниСобытийМЭДО.Предупреждение,
		Документ,
		МЭДО.Текст_НеуспешнаяОтправка(),
		МЭДО.Текст_СнятиеПризнакаГотовностиКОтправке(),
		ДанныеОтвета);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Текст_ОшибкаЗаписиДанныхДокумента()
	
	Возврат НСтр("ru = 'Ошибка записи ""Данных документа МЭДО""'");
	
КонецФункции

#КонецОбласти

#КонецЕсли
